<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Hệ thống cửa chống trộm</title>
  <link rel="stylesheet" href="/style.css">
</head>
<body>
  <div class="container">
    <video class="video" controls>
      <source src="/5ff19371c054ff34eebb7accc053cc5f.mp4" type="video/mp4">
    </video>
    <div class="container-image">
      <img src="/409437870_1496661400891933_4885605364541779327_n.jpg" alt="">
    <img src="/414440179_1070163794135352_8856932657970677576_n.jpg" alt="">
    <img src="/414479856_924488695705879_8135953223445114582_n.jpg" alt="">
    </div>
    
  </div>
    
    <div style="text-align: justify;"></div>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;"><br></p>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;"><strong>*Giới thiệu:</strong></p>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;">Hiện nay, thực trạng trộm cắp đang diễn biến v&ocirc; c&ugrave;ng phức tạp. Phương thức hoạt động của tội phạm tuy kh&ocirc;ng mới, vẫn l&agrave; lợi dụng người d&acirc;n vắng nh&agrave;, mất cảnh gi&aacute;c để ăn trộm. Hơn thế, c&aacute;c loại kho&aacute; cơ bản hay ngay cả những loại kho&aacute; điện tử tưởng chừng như c&oacute; thể ngăn ngừa sự đột nhập, tuy vậy, vẫn c&oacute; rủi ro cao khi thủ đoạn của ch&uacute;ng c&agrave;ng ng&agrave;y c&agrave;ng tinh vi. V&igrave; vậy, ch&uacute;ng em mang đến đ&acirc;y một bộ thiết bị để giảm thiểu tối đa thực trạng n&agrave;y: <strong>Hệ thống cửa chống x&acirc;m nhập.</strong></p>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;">Lợi dụng chức năng của cảm biến hồng ngoại, ch&uacute;ng em đ&atilde; x&acirc;y dựng đề &aacute;n &quot;cửa an to&agrave;n&quot;. Cảm biến hồng ngoại l&agrave; một thiết bị điện tử ph&aacute;t hoặc nhận bức xạ hồng ngoại trong m&ocirc;i trường xung quanh. Khi vật thể ph&aacute;t ra nhiệt độ tr&ecirc;n 35 độ C th&igrave; sẽ ph&aacute;t ra bức xạ hồng ngoại con người kh&ocirc;ng thể nh&igrave;n thấy được. V&igrave; vậy, m&agrave; c&oacute; thể nhận diện được người x&acirc;m nhập khi hệ thống hoạt động. Tr&ecirc;n thực tế, thị trường hiện nay cũng đ&atilde; xuất hiện nhiều loại chu&ocirc;ng b&aacute;o kẻ x&acirc;m nhập sử dụng cảm biến hồng ngoại. Nhưng chỉ c&oacute; thể cảnh b&aacute;o, do đ&oacute;, vẫn xuất hiện nhiều rủi ro khi tội phạm ng&agrave;y nay c&agrave;ng ng&agrave;y c&agrave;ng manh động.</p>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;">Nhận thấy được điều n&agrave;y, sản phẩm của ch&uacute;ng em được cải tiến th&ecirc;m hệ thống cửa an to&agrave;n. Khi c&oacute; kẻ x&acirc;m nhập, hệ th&ocirc;ng kh&ocirc;ng chỉ cảnh b&aacute;o m&agrave; c&ograve;n gia tăng sự an to&agrave;n bằng việc một lớp cửa sẽ được đ&oacute;ng nhằm c&oacute; th&ecirc;m thời gian cho chủ nh&acirc;n hiểu được t&igrave;nh h&igrave;nh v&agrave; b&aacute;o c&aacute;o kịp thời với cơ quan chức năng. Hệ thống cửa v&agrave; chu&ocirc;ng b&aacute;o sẽ lu&ocirc;n hoạt động nếu kh&ocirc;ng nhận được t&iacute;n hiệu dừng lại của điều khiển.</p>
<p style="margin-top: 0pt; margin-bottom: 8pt; line-height: 108%; font-size: 15pt; text-align: justify;">M&ocirc; h&igrave;nh dưới đ&acirc;y l&agrave; sự thu nhỏ của thiết bị chống x&acirc;m nhập của ch&uacute;ng em gồm đầy đủ cảm biến hồng ngoại, cửa an to&agrave;n, hệ thống cảnh b&aacute;o được ho&agrave;n th&agrave;nh bằng:<strong>&nbsp;</strong></p>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;">-Bo mạch Arduino Uno</p>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;">-Cảm biến vật cản hồng ngoại</p>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;">-Bộ thu hồng ngoại</p>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;">-Điều khiển hồng ngoại</p>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;">-Chu&ocirc;ng</p>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;">-Động cơ servo</p>
<p style="margin-top: 0pt; margin-bottom: 8pt; line-height: 108%; font-size: 15pt; text-align: left;"><br></p>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;">*<strong>Quy tr&igrave;nh vận h&agrave;nh:</strong></p>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;">&nbsp; Khi hệ thống được bật l&ecirc;n l&uacute;c n&agrave;y cảm biến vật cản hồng ngoại sẽ c&oacute; thể ph&aacute;t hiện được người đi đến gần c&aacute;nh cửa.Khi c&oacute; người đến gần tay nắm cửa cảm biến sẽ truyền th&ocirc;ng tin đến bo mạch aruino, sau đ&oacute; mạch sẽ k&iacute;ch hoạt động cơ từ đ&oacute; 1 lớp cửa nữa sẽ được đ&oacute;ng lại v&agrave; chu&ocirc;ng sẽ được ph&aacute;t l&ecirc;n.Khi người d&ugrave;ng muốn tắt đi cảnh b&aacute;o th&igrave; sẽ d&ugrave;ng điều khiển để dừng lại mọi hoạt động của hệ thống.</p>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;"><strong>*Nguy&ecirc;n l&yacute; hoạt động:</strong></p>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;">-Hệ thống sử dụng bo mạch của arduino để xử l&yacute; c&aacute;c t&iacute;n hiệu đến v&agrave; đi.Trong mạch được tải v&agrave;o đ&oacute; một chương tr&igrave;nh được viết bằng ng&ocirc;n ngữ lập tr&igrave;nh c++.Khi bo mạch nhận được một t&iacute;n hiệu đến th&igrave; l&uacute;c đ&oacute; chương tr&igrave;nh của hệ thống sẽ được chạy để xử l&yacute; c&aacute;c logic từ đ&oacute; chuyền được loại t&iacute;n hiệu đi ph&ugrave; hợp.</p>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;">-Tr&ecirc;n cảm biến ph&aacute;t hiện vật cản hồng ngoại, cảm biến sẽ ph&aacute;t ra 1 loạt s&oacute;ng hồng ngoại li&ecirc;n tục, khi c&oacute; 1 vật cản đi v&agrave;o tầm ph&aacute;t của cảm biến th&igrave; s&oacute;ng hồng ngoại sẽ được hắt lại v&agrave; đi v&agrave;o đầu thu của cảm biến, sau đ&oacute; t&iacute;n hiệu sẽ được truyền về bo mạch ch&iacute;nh.</p>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;">*<strong>Ứng dụng:</strong></p>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;">Hệ thống ph&ugrave; hợp gia đ&igrave;nh hoặc c&ocirc;ng ty để tr&aacute;nh những x&acirc;m nh&acirc;m ngo&agrave;i mong muốn</p>
<p style="margin-top:0pt; margin-bottom:8pt; line-height:108%; font-size:15pt;">&nbsp;</p>

</body>
</html>